# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [46]:
# import libraries here
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
# your code here
temp = pd.read_csv("Temp_States.csv")

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Print `temp`.

In [4]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [8]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
# In the temp data set, there are two data types,  city and state have object type and temperature has float 
"""

#### Select the rows where state is New York.

In [10]:
# your code here
temp[temp["State"]== "New York"]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [14]:
# your code here
print(temp[temp["State"]== "New York"]["Temperature"].mean())

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [18]:
# your code here
temp.loc[temp["Temperature"] >= 15, ["State", "City"]]

         State      City
0     New York       NYC
3  Connecticut  Hartford
5   New Jersey    Treton
6   New Jersey    Newark

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [19]:
# your code here
temp.loc[temp["Temperature"] >= 15, ["City"]]

       City
0       NYC
3  Hartford
5    Treton
6    Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [26]:
# your code here
temp.loc[(temp["Temperature"] > 15) & (temp["Temperature"] < 20), ["City"]]

       City
0       NYC
3  Hartford

#### Find the mean and standard deviation of the temperature of each state.

In [59]:
# your code here
temp.groupby("State").agg({"Temperature": [np.mean, np.std]})

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [64]:
# your code here
employees = pd.read_csv("Employee.csv")

#### Explore the data types of the `employees` dataframe. Comment your results.

In [68]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
Employees dataframe has 6 columns, and 2 data types: ["Department", "Education", "Gender", "Title"] have data type object (String) and ["Years", "Salary"] have data type int (Numeric)
"""

#### What's the average salary in this company?

In [69]:
# your code here
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [71]:
# your code here
employees["Salary"].max()

70

#### What's the lowest salary?

In [73]:
# your code here
employees["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [83]:
# your code here
employees[employees["Salary"] == employees["Salary"].min()]["Name"]

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [85]:
# your code here
employees[employees["Name"] == "David"]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [86]:
# your code here
employees[employees["Name"] == "David"]["Salary"]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [87]:
# your code here
print(employees[employees["Title"] == "associate"])

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [88]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [100]:
# Method 2
# your code here
employees.iloc[0:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [104]:
# your code here
employees[(employees["Title"] == "associate") & (employees["Salary"] > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [108]:
# your code here
employees.groupby(["Years"]).agg({"Salary" : "mean"})

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [109]:
# your code here
employees.groupby(["Title"]).agg({"Salary" : "mean"})

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [116]:
# your code here
q1 = employees["Salary"].quantile(0.25)
q2 = employees["Salary"].quantile(0.5)
q3 = employees["Salary"].quantile(0.75)
q4 = employees["Salary"].quantile(1)

q1, q2, q3, q4

(35.0, 55.0, 60.0, 70.0)

#### Is the mean salary different per gender?

In [121]:
# your code here
employees.groupby(["Gender"]).agg({"Salary": "mean"})

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [128]:
# your code here
employees.groupby(["Department"]).agg({min, "mean", max})

C:\Users\udaya\AppData\Local\Temp\ipykernel_19656\1854990214.py:2: FutureWarning: ['Name', 'Education', 'Gender', 'Title'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  employees.groupby(["Department"]).agg({min, "mean", max})

           Years               Salary
             min max      mean    min max   mean
Department
HR             2   8  4.666667     30  70  45.00
IT             1   8  4.500000     30  70  48.75
Sales          2   3  2.500000     55  55  55.00

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [132]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here